let messages = [
    {
        "id": -999990489,
        "type": "service",
        "date": "2018-12-04T14:42:59",
        "actor": "Enord",
        "actor_id": 4872517562,
        "action": "create_group",
        "title": "NS",
        "members": [
            "Enord",
            "Андрей Козлов",
            "Sergey"
        ],
        "text": ""
    },
    {
        "id": -999990485,
        "type": "service",
        "date": "2018-12-04T14:43:59",
        "actor": "Aleksandr Maksimov",
        "actor_id": 4684961300,
        "action": "join_group_by_link",
        "inviter": "Group",
        "text": ""
    },
    {
        "id": -999990484,
        "type": "message",
        "date": "2018-12-04T14:44:13",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Эт, так, мало ли, чтоб не терялись"
    },
    {
        "id": -999990482,
        "type": "message",
        "date": "2018-12-04T14:44:29",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Ок"
    },
    {
        "id": -999990481,
        "type": "message",
        "date": "2018-12-04T14:44:33",
        "from": "Sergey",
        "from_id": 4837711668,
        "file": "(File not included. Change data exporting settings to download.)",
        "thumbnail": "(File not included. Change data exporting settings to download.)",
        "media_type": "sticker",
        "sticker_emoji": "👆",
        "width": 512,
        "height": 512,
        "text": ""
    },
    {
        "id": -999990480,
        "type": "message",
        "date": "2018-12-04T14:44:39",
        "edited": "2018-12-04T14:44:42",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Да да именно"
    },
    {
        "id": -999990479,
        "type": "service",
        "date": "2018-12-04T14:45:07",
        "actor": "Сергей Тестировщик",
        "actor_id": 4824308605,
        "action": "join_group_by_link",
        "inviter": "Group",
        "text": ""
    },
    {
        "id": -999990453,
        "type": "service",
        "date": "2018-12-04T14:59:42",
        "actor": "Aleksandr Maksimov",
        "actor_id": 4684961300,
        "action": "invite_members",
        "members": [
            "Михаил Иванников"
        ],
        "text": ""
    },
    {
        "id": -999990447,
        "type": "message",
        "date": "2018-12-04T15:01:11",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Так постепенно сюда курилочка переберется"
    },
    {
        "id": -999990446,
        "type": "message",
        "date": "2018-12-04T15:03:31",
        "from": "Sergey",
        "from_id": 4837711668,
        "file": "(File not included. Change data exporting settings to download.)",
        "thumbnail": "(File not included. Change data exporting settings to download.)",
        "media_type": "sticker",
        "sticker_emoji": "👀",
        "width": 512,
        "height": 512,
        "text": ""
    },
    {
        "id": -999990445,
        "type": "message",
        "date": "2018-12-04T15:19:39",
        "from": "Sergey",
        "from_id": 4837711668,
        "photo": "(File not included. Change data exporting settings to download.)",
        "width": 750,
        "height": 953,
        "text": ""
    },
    {
        "id": -999990444,
        "type": "message",
        "date": "2018-12-04T15:24:48",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Xcode to warm your anus"
    },
    {
        "id": -999990443,
        "type": "message",
        "date": "2018-12-04T15:25:12",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Indeed"
    },
    {
        "id": -999990343,
        "type": "service",
        "date": "2018-12-04T18:41:25",
        "actor": "Vitaly Pereslavtsev",
        "actor_id": 4476915998,
        "action": "join_group_by_link",
        "inviter": "Group",
        "text": ""
    },
    {
        "id": -999990342,
        "type": "message",
        "date": "2018-12-04T18:43:49",
        "from": "Михаил Иванников",
        "from_id": 4338350936,
        "text": "Создаём свой норсофт с нормальными зарплатами? )"
    },
    {
        "id": -999990341,
        "type": "message",
        "date": "2018-12-04T18:44:31",
        "from": "Sergey",
        "from_id": 4837711668,
        "file": "(File not included. Change data exporting settings to download.)",
        "thumbnail": "(File not included. Change data exporting settings to download.)",
        "media_type": "sticker",
        "sticker_emoji": "✋",
        "width": 512,
        "height": 512,
        "text": ""
    },
    {
        "id": -999990340,
        "type": "message",
        "date": "2018-12-04T18:44:39",
        "from": "Sergey",
        "from_id": 4837711668,
        "file": "(File not included. Change data exporting settings to download.)",
        "thumbnail": "(File not included. Change data exporting settings to download.)",
        "media_type": "sticker",
        "sticker_emoji": "🔩",
        "width": 512,
        "height": 512,
        "text": ""
    },
    {
        "id": -999990339,
        "type": "message",
        "date": "2018-12-04T18:46:07",
        "from": "Михаил Иванников",
        "from_id": 4338350936,
        "text": "Уже :D"
    },
    {
        "id": -999990338,
        "type": "message",
        "date": "2018-12-04T18:46:25",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Ахах"
    },
    {
        "id": -999990337,
        "type": "message",
        "date": "2018-12-04T18:46:32",
        "from": "Sergey",
        "from_id": 4837711668,
        "file": "(File not included. Change data exporting settings to download.)",
        "thumbnail": "(File not included. Change data exporting settings to download.)",
        "media_type": "sticker",
        "sticker_emoji": "💸",
        "width": 512,
        "height": 512,
        "text": ""
    },
    {
        "id": -999990336,
        "type": "message",
        "date": "2018-12-04T18:46:36",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Ну можно вакансии сюда или подработочке кидать"
    },
    {
        "id": -999990335,
        "type": "message",
        "date": "2018-12-04T18:46:54",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Ну да кстати"
    },
    {
        "id": -999990334,
        "type": "message",
        "date": "2018-12-04T18:47:21",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Та рексофт мидла ищут, js react все как у всех 2 года норм"
    },
    {
        "id": -999990333,
        "type": "message",
        "date": "2018-12-04T18:47:41",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "80к испыталка"
    },
    {
        "id": -999990331,
        "type": "message",
        "date": "2018-12-04T18:48:58",
        "from": "Enord",
        "from_id": 4872517562,
        "text": [
            "Интересная вакансия \"Front-end разработчик\" — ",
            {
                "type": "link",
                "text": "https://hh.ru/vacancy/29155280?from=share_android"
            },
            "\nОтправлено с помощью мобильного приложения hh ",
            {
                "type": "link",
                "text": "https://hh.ru/mobile?from=share_android"
            },
            ""
        ]
    },
    {
        "id": -999990330,
        "type": "message",
        "date": "2018-12-04T19:49:08",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "это мини хедхантер?"
    },
    {
        "id": -999990329,
        "type": "message",
        "date": "2018-12-04T19:50:07",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Пока все не свалят с норсофта, я думаю"
    },
    {
        "id": -999990328,
        "type": "message",
        "date": "2018-12-04T19:52:45",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "что вас держит?)"
    },
    {
        "id": -999990327,
        "type": "message",
        "date": "2018-12-04T19:56:52",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Ну в принципе у вас опыта много коллектив да, топовый, порофлить самое то. С романом сегодня говорил пересмотра политики не будет, т.е все как прежде"
    },
    {
        "id": -999990324,
        "type": "message",
        "date": "2018-12-04T19:59:49",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Порофлить?"
    },
    {
        "id": -999990323,
        "type": "message",
        "date": "2018-12-04T20:00:18",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Андрюха из другого поколения"
    },
    {
        "id": -999990322,
        "type": "message",
        "date": "2018-12-04T20:00:27",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Не шарит"
    },
    {
        "id": -999990321,
        "type": "message",
        "date": "2018-12-04T20:00:54",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Да кидаются всякими заморскими словечками"
    },
    {
        "id": -999990320,
        "type": "message",
        "date": "2018-12-04T20:01:00",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "А ты сидишь гугли"
    },
    {
        "id": -999990319,
        "type": "message",
        "date": "2018-12-04T20:01:00",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Ну тип всякие шутеечки и прочее"
    },
    {
        "id": -999990318,
        "type": "message",
        "date": "2018-12-04T20:01:46",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "А че с романом говорили? Что нибудь интересное?"
    },
    {
        "id": -999990316,
        "type": "message",
        "date": "2018-12-04T20:02:31",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Ну тип все моменты про премии/бонусы/англ для каждого/прозрачный рост/и проче все, что ранее высказывал собственно все так же останется с его слов. Мол они не могут позволить себе подобное"
    },
    {
        "id": -999990314,
        "type": "message",
        "date": "2018-12-04T20:03:17",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Ну если ничего не менять, то понятно что оно само и не появиться"
    },
    {
        "id": -999990311,
        "type": "message",
        "date": "2018-12-04T20:03:59",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": [
            {
                "type": "mention",
                "text": "@enord"
            },
            " а ты когда на работу сразу или две недели отдохнёшь?"
        ]
    },
    {
        "id": -999990309,
        "type": "message",
        "date": "2018-12-04T20:04:33",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Ну я позвонил мне сказали тип збс что пораньше, спроси про спеки для пк, зазак оформили завтра/послезавтра привезут и я выхожу"
    },
    {
        "id": -999990308,
        "type": "message",
        "date": "2018-12-04T20:04:39",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "пт/пн"
    },
    {
        "id": -999990307,
        "type": "message",
        "date": "2018-12-04T20:05:22",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Ну расскажешь тогда что там и как"
    },
    {
        "id": -999990306,
        "type": "message",
        "date": "2018-12-04T20:05:28",
        "edited": "2018-12-04T20:05:35",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "но парни конечно неудобно сделали, я как бы предупредил за две недели, расчитывал на эти две недели, утром проснулся везде все блокнуто, кроме слека и написано тип мы тебе предлагаем расчитать все и не приходить в прицнипе."
    },
    {
        "id": -999990305,
        "type": "message",
        "date": "2018-12-04T20:05:53",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Да наверное не хотели платить просто"
    },
    {
        "id": -999990304,
        "type": "message",
        "date": "2018-12-04T20:05:57",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "Тип могли бы хоть вчера сразу сказать, они подождали ks"
    },
    {
        "id": -999990303,
        "type": "message",
        "date": "2018-12-04T20:06:17",
        "from": "Enord",
        "from_id": 4872517562,
        "reply_to_message_id": -999990305,
        "text": "Ну тут хз мне кажется не такие уж и деньги по факту"
    },
    {
        "id": -999990302,
        "type": "message",
        "date": "2018-12-04T20:06:17",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "У тебя же по сути активных проектов не было?"
    },
    {
        "id": -999990301,
        "type": "message",
        "date": "2018-12-04T20:06:18",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "не,"
    },
    {
        "id": -999990300,
        "type": "message",
        "date": "2018-12-04T20:06:29",
        "from": "Enord",
        "from_id": 4872517562,
        "reply_to_message_id": -999990302,
        "text": "ну мне разве что на две недели чет простое"
    },
    {
        "id": -999990299,
        "type": "message",
        "date": "2018-12-04T20:06:33",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "в прицнипе логика есть"
    },
    {
        "id": -999990297,
        "type": "message",
        "date": "2018-12-04T20:06:55",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Че Серёг не добавил?"
    },
    {
        "id": -999990294,
        "type": "message",
        "date": "2018-12-04T20:07:29",
        "from": "Enord",
        "from_id": 4872517562,
        "reply_to_message_id": -999990297,
        "text": "Не понял"
    },
    {
        "id": -999990293,
        "type": "message",
        "date": "2018-12-04T20:07:53",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Я тут"
    },
    {
        "id": -999990292,
        "type": "message",
        "date": "2018-12-04T20:08:09",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Ты алекс"
    },
    {
        "id": -999990291,
        "type": "message",
        "date": "2018-12-04T20:08:21",
        "from": "Sergey",
        "from_id": 4837711668,
        "file": "(File not included. Change data exporting settings to download.)",
        "thumbnail": "(File not included. Change data exporting settings to download.)",
        "media_type": "sticker",
        "sticker_emoji": "✍",
        "width": 512,
        "height": 512,
        "text": ""
    },
    {
        "id": -999990286,
        "type": "message",
        "date": "2018-12-04T20:09:08",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Алекс мой интернет никнейм"
    },
    {
        "id": -999990285,
        "type": "message",
        "date": "2018-12-04T20:09:30",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Тогда ты кто?"
    },
    {
        "id": -999990284,
        "type": "message",
        "date": "2018-12-04T20:09:44",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Ток не пиши я бетмен"
    },
    {
        "id": -999990283,
        "type": "message",
        "date": "2018-12-04T20:09:54",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "))"
    },
    {
        "id": -999990282,
        "type": "message",
        "date": "2018-12-04T20:09:58",
        "from": "Sergey",
        "from_id": 4837711668,
        "text": "Я Серега"
    },
    {
        "id": -999990281,
        "type": "message",
        "date": "2018-12-04T20:10:08",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Не ну логично"
    },
    {
        "id": -999990280,
        "type": "message",
        "date": "2018-12-04T20:10:20",
        "from": "Андрей Козлов",
        "from_id": 4714806336,
        "text": "Серёга с никнеймом алекс"
    },
    {
        "id": -999990279,
        "type": "message",
        "date": "2018-12-04T20:10:34",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "я бэтмен"
    },
    {
        "id": -999990278,
        "type": "message",
        "date": "2018-12-04T20:10:45",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "с никнеймом серега"
    },
    {
        "id": -999989270,
        "type": "message",
        "date": "2018-12-06T13:05:13",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "сижу с 3 бабами в кабинете"
    },
    {
        "id": -999989269,
        "type": "message",
        "date": "2018-12-06T13:05:29",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "неплохо"
    },
    {
        "id": -999989268,
        "type": "message",
        "date": "2018-12-06T13:05:35",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "и че и как"
    },
    {
        "id": -999989267,
        "type": "message",
        "date": "2018-12-06T13:05:38",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "пока ток доки"
    },
    {
        "id": -999989266,
        "type": "message",
        "date": "2018-12-06T13:05:42",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "и завел себе кабинеты везде"
    },
    {
        "id": -999989265,
        "type": "message",
        "date": "2018-12-06T13:05:49",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "мне правда дали до 6 время"
    },
    {
        "id": -999989264,
        "type": "message",
        "date": "2018-12-06T13:05:56",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "я прост хуи пинаю сижу"
    },
    {
        "id": -999989263,
        "type": "message",
        "date": "2018-12-06T13:06:00",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "ниче нового"
    },
    {
        "id": -999989262,
        "type": "message",
        "date": "2018-12-06T13:06:12",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "задача просто проверки делать и все"
    },
    {
        "id": -999989261,
        "type": "message",
        "date": "2018-12-06T13:06:19",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "чеклисты делать не надо"
    },
    {
        "id": -999989260,
        "type": "message",
        "date": "2018-12-06T13:06:21",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "тк джун"
    },
    {
        "id": -999989259,
        "type": "message",
        "date": "2018-12-06T13:06:42",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "график тож свободныц как поставлю"
    },
    {
        "id": -999989258,
        "type": "message",
        "date": "2018-12-06T13:07:00",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "комп топ"
    },
    {
        "id": -999989257,
        "type": "message",
        "date": "2018-12-06T13:07:05",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "16 оперативы"
    },
    {
        "id": -999989256,
        "type": "message",
        "date": "2018-12-06T13:07:07",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "ай5"
    },
    {
        "id": -999989255,
        "type": "message",
        "date": "2018-12-06T13:07:24",
        "from": "Михаил Иванников",
        "from_id": 4338350936,
        "text": "А в норсофте мак был :D"
    },
    {
        "id": -999989254,
        "type": "message",
        "date": "2018-12-06T13:07:28",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "аахха"
    },
    {
        "id": -999989253,
        "type": "message",
        "date": "2018-12-06T13:07:34",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "ну все"
    },
    {
        "id": -999989252,
        "type": "message",
        "date": "2018-12-06T13:07:36",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "возвращаюсь"
    },
    {
        "id": -999989251,
        "type": "message",
        "date": "2018-12-06T13:12:28",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "кружку ручку и ежедневник  подогнали"
    },
    {
        "id": -999989250,
        "type": "message",
        "date": "2018-12-06T13:12:36",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "теперь можно увольняться"
    },
    {
        "id": -999989249,
        "type": "message",
        "date": "2018-12-06T13:12:53",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "кружка как знак что ты тамбыл?"
    },
    {
        "id": -999989248,
        "type": "message",
        "date": "2018-12-06T13:12:59",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "ну да"
    },
    {
        "id": -999989247,
        "type": "message",
        "date": "2018-12-06T13:13:01",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "все от дср"
    },
    {
        "id": -999989246,
        "type": "message",
        "date": "2018-12-06T13:13:06",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "илитно"
    },
    {
        "id": -999989245,
        "type": "message",
        "date": "2018-12-06T13:13:06",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "в нурсфоте тебе кружку ж не выдали?"
    },
    {
        "id": -999989244,
        "type": "message",
        "date": "2018-12-06T13:13:15",
        "from": "Сергей Тестировщик",
        "from_id": 4824308605,
        "text": "нет , я унтерменш"
    },
    {
        "id": -999989243,
        "type": "message",
        "date": "2018-12-06T13:13:16",
        "from": "Enord",
        "from_id": 4872517562,
        "text": "там только андрюха"
    },
    {
        "id": -999989242,
        "type": "message",
        "date": "2018-12-06T13:13:19",
        "from": "Михаил Иванников",
        "from_id": 4338350936,
        "text": "Жлобы"
    },
    {
        "id": -999989241,
        "type": "message",
        "date": "2018-12-06T13:13:27",
        "from": "Михаил Иванников",
        "from_id": 4338350936,
        "text": "В норсофте"
    },
]

const uniqueSet = new Set(messages.map( item => {
    return `Name: ${item.from} ID:${item.from_id} ID:${item.from_id}`
}))


// const countMessage = new Set(messages.map(item => {
//     for (let i = 0; i < length; i++) {
//     }
//     return `${item.from}: ${item.text}`
// }))
//
// const backToArrayM = [...countMessage]
// backToArrayM.shift()
// console.log(backToArrayM);

const backToArray = [...uniqueSet]
backToArray.shift()
console.log(backToArray.length, backToArray);
